chcp 65001
@echo off
setlocal
rem 注意1-25行的数据不可以删除、添加、交换任何一行！！！
rem *****************************************************************************************
rem 要输入的图片格式。
rem format="  png   bmp    tif      tiff      jxl   "
rem *****************************************************************************************
rem 1表示PNG，2表示JXL。
rem out=2
rem *****************************************************************************************
rem 1表示什么都不做，2表示缩放并且改为800dpi，3表示仅改为800dpi 。(注意JXL不支持设置dpi)。
rem mode=2
rem *****************************************************************************************
rem 1表示保留原文件名，2表示忽略原文件名仅从bename、afname中读取。
rem rename=1
rem *****************************************************************************************
rem 设置改名时编号的起始索引。
rem index=1
rem *****************************************************************************************
rem 定义文件名的前缀。
rem bename=""
rem *****************************************************************************************
rem 定义文件名的后缀。
rem afname=""
rem *****************************************************************************************
rem 定义文件名时支持的变量有：图片宽度[*x]，图片高度[*y]，[*index]文件索引（按文件名升序排列，至少两位数字）。
rem *****************************************************************************************

java -jar "D:\字幕\快速处理视频bat脚本\小工具\图片处理\扫图处理\Java\扫图处理.jar" "%~f0"
pause

rem Scan_[*index]